{
	"gray": [
		{
			"name":"Castafiore",
			"type":"WebGL-visualisering för Spotify",
			"who":"Emil Axelsson",
			"id":"castafiore",
			"link":"http://emilaxelsson.se/posts/2014-01-08-Castafiore-an-audio-visualizer-for-Spotify",
			"linktext":"Läs mer",
			"nomination":"Castafiore är skriven i JavaScript och hon tror att hon är artistisk och duktig när hon skvätter färger i takt till musiken. Hon använder GLSL för att få vattenfärgen att rinna ner och blandas. Hon är egentligen inte så musikalisk utan mer bara hetsig och enspårig och tittar på hur frekvensspekrat förändras från frame till frame."
		},
		{
			"name":"The Krektus Crash",
			"type":"Spel",
			"who":"Andreas Lindgren, Axel Brinkeby, Henrietta Rydfalk, Eleonora Kolesnikova",
			"id":"krektus",
			"link":"http://brinkeby.se/KrektusCrash.jar",
			"linktext":"Ladda ned spelet",
			"nomination":"Spelet går ut på att man som spelare styr en liten alien och med hjälp utav olika attacker försvara dennes rymdskepp. Eftersom det aldrig kommer något moderskepp och räddar den stackars varelsen så har spelet inget \"win-state\" utan det går ut på att få en så hög highscore som möjligt. Projektet gjordes i kursen TNM040 koma, alltså låg fokus på att göra ett användargränssnitt."
		},
		{
			"name":"Mote.fm",
			"type":"Webb- och Spotifyapp",
			"who":"Klas Eskilson, Erik Larsson, Daniel Rönnkvist, Einar Sandberg",
			"id":"mote",
			"link":"https://vimeo.com/86263314",
			"linktext":"Se en film",
			"nomination":"Mote.fm är en webb- och Spotify-app för att lösa konflikter som uppstår på fester runt vilken musik som skall ligga i spotifys kölista. Genom att flytta väljandet av musik till handhållna enheter behöver ingen brottas framför datorn och ingen kan fuska genom att lägga sin egna låt först. Tillsammans kan gästerna föreslå och rösta på vilka låtar de helst vill höra. Med Mote.fm har du tillgång och kan söka i hela Spotifys musikbibliotek. När du lägger till en låt eller röstar på någon annans låt uppdateras Mote.fm automatiskt utan att du som användare måste uppdatera hemsidan."
		},
		{
			"name":"Photomosaic",
			"type":"Matlabapplikation",
			"who":"Axel Kinner, Alexander Svensson",
			"id":"photo",
			"nomination":"Genom att använda snabbheten i en bilddatabas så kan man snabbt och enkelt skapa en mosiac-bild genom att jämföra varje subbild i originalbild man vill skapa en mosaic-bild av, mot de som finns i bilddatabasen. Den mest liknande bilden i databasen ersätter sedan varje subbild i originalbilden. Programmet använder sig av PCA-kompression för att minska andelen data som behövs för att spara bildbeskrivningen i databasen. Programmet kan använda sig av en quad-tree search för att hitta subbilderna som skall ersättas, istället för att använda en fixt storlek på subbilden, se bild."
		},
		{
			"name":"Physically based simulation of fire",
			"type":"Eldsimulering",
			"who":"Andreas Valter, Axel Kinner, Johan Norén, Johannes Deligiannis, Viktor Nilsson",
			"id":"eldsim",
			"link":"http://www.youtube.com/watch?v=F40_rowaLQg",
			"nomination":"I projektet har matematiska och fysiska modeller implementerats i C++ för att simulera hur eld beter sig i verkligheten. Eftersom modellerna som använts är riktiga matematiska och fysiska modeller så kan man skapa olika typer av lågor och eldar genom att ändra och tweaka verkliga variabler. Om man i simuleringen t.ex matar in en bränsledensitet och antändningstemperatur som överensstämmer med metangas så kommer den simulerade lågan att röra sig och se ut ungefär som en låga på metangas hade gjort i verkligheten. "
		},
		{
			"name":"SGCTSky",
			"type":"Molnsimulering för domen",
			"who":"Fredrik Lindner, Aron Tornberg, Sebastian Piwell",
			"id":"sgctsky",
			"link":"https://docs.google.com/file/d/0BzjBHmpNGNxGT3V5dktYakw1RVU/",
			"linktext":"Se en film",
			"nomination":"SGCTSky är en realtids-atmosfär-och-moln-simulator som är gjord för att visas på Domen i Visualiseringscenter. SGCTSky utvecklades i samband med kursen TNM061 (3D Datorgrafik) som vi läste vårterminen i årskurs 2. SGCTSky gör det alltså möjligt att visa en himmel (natt och dag) med moln i fullt interaktiva hastigheter på Domen."
		},
		{
			"name":"Spökljus",
			"type":"Multiplayer-spel och spelmotor",
			"who":"Kalle Bladin, Erik Broberg, Tim Brodin, Måns Bränneby, Martin Gråd",
			"id":"spokljus",
			"link":"http://www.youtube.com/watch?v=wSeQsk_Lvp0",
			"linktext":"Se en film",
			"nomination":"Som projektarbete i kursen TNM061 (3D-datorgrafik) gjorde vi ett multiplayer-spel och en egen spelmotor. Varje spelar är ett spöke med en yxa och en ficklampa, och tillsammans med sitt lag utforskar man en mörk miljö för att hitta det andra laget som man sedan ska fightas mot. Fokus lades på själva spelmotorn, vilken inkluderar en egen scengraf och beräkning kastskuggor för varje ljuskälla. En höjdmap användes för att ge spelarna en korrekt höjdposition och för att detektera kollision med väggar och dylikt. För att kunna ladda in en godtycklig spelplan/bana, implementerades en algoritm för att generera denna höjdmap automatiskt utifrån den 3D-modell som beskriver banan. "
		},
		{
			"name":"Tube Wars",
			"type":"FPS-shooter",
			"who":"Alexander Cederblad, Philip Burridge , Rasmus Haapaoja, Fredrik Johnson , Hannes Ingelhag",
			"id":"tubewars",
			"link":"https://drive.google.com/a/student.liu.se/file/d/0B3Kzaau-27NqNk94MGhENXR0bkk/edit?usp=sharing",
			"linktext":"Se en film",
			"nomination":"Tube Wars är en fps-shooter där man spelar 2 vs. 2 på en kompakt och högintensiv arena. Spelet är skapat i Unity Engine. Alla modeller, texturer, ljud (utom ambient-ljudet), partikeleffekter samt närverket har vi skapat själva. Detta är ett projekt som knyter samman medieteknikprogrammet på ett bra sätt då allt ifrån programmering, förståelse för en grafikmotor samt konstnärligt artistisk anda är ett måste!"
		},
		{
			"name":"WebGL Procedural Water",
			"type":"Reflekterande vattenyta i WebGL",
			"who":"Jonas Zeitler",
			"id":"water",
			"link":"http://jonaszeitler.se/webgl-procedural-water/",
			"linktext":"Se en demo",
			"nomination":"En reflekterande/refrakterande vattenyta i webGL. Målet med projektet var att skapa någon grafikkomponent och undvika att använda förberäknade meshar/texturer (och istället generera dessa procedurellt)."
		}
	],
	"orange": [
		{
			"name":"Grizzly Beer",
			"type":"Reklamfilm",
			"who":"Alexander Johansson, Belinda Bernfort, Rasmus Karlsson, Hans­Christian Helltegen, Gustav Lagnström, Viktor Axelsson",
			"id":"grizzly",
			"link":"http://www.youtube.com/watch?v=JyqW4IS2SAw",
			"linktext":"Se filmen",
			"nomination":"En reklamfilm utöver det vanliga med inspiration från påkostade reklamfilmer så som Coca Cola Zero och Old Spice. I filmen får man se hur en tämligen huslig man börjar drömma sig bort till en mer spänningsfylld tillvaro, med inslag av armbrytning, björnjakt och explosioner. Detta gör honom sugen på en Grizzly Beer och när denna inmundigas sker en fantastiskt transformation."
		},
		{
			"name":"Growth",
			"type":"Kortilm",
			"who":"Adam Alsegård, Benjamin Wiberg, Oscar Nord, Adrian Palmqvist",
			"id":"growth",
			"link":"http://growthmovie.se",
			"linktext":"Se filmen",
			"nomination":"Growth är en science fiction-kortfilm som utspelar sig i en nära framtid där all växtlighet har förmultnat och tillgången på mat är obefintlig. Folket tvingas förlita sig på företaget Growth, som med sitt syntetiska matsubstitut har fått monopol på näringsmarknaden. Alla är dock inte eniga om att hoppet om en fri marknad har dött ut..."
		},
		{
			"name":"Rob's vengeance",
			"type":"Animerad kortfilm",
			"who":"Filip Kantedal, David Johansson, Lovisa Hassler, Simon Hedlund, Sovanny Huy Nikkilä",
			"id":"robsven",
			"link":"http://www.youtube.com/watch?v=Hiiruh8nHKQ",
			"linktext":"Se filmen",
			"nomination":"Med undantag från viss texturering är all modellering, animering, ljudläggning samt musik producerad av gruppen. Mycket av det producerade materialet är skapat direkt utifrån gruppmedlemmarnas egna idéer. Exempelvis är roboten modellerad helt utan att följa någon mall, även om ögonen inspirerats från Wall-E. Mycket tid har lagts på kreativa detaljer både för visualisering och ljudproduktion. Filmen är väldigt raffinerad med tanke på de fem låtarna som skrevs till filmen varav en platsade och vi skapade nästintill 100 modellerade objekt varav ca 70 kvalificerades."
		}

	]
}
